app/controllers/routes_controller.rb

  def index
    @routes = Route.all
    @routes = @routes.page params[:page]
---
SELECT "routes".* FROM "routes"
SELECT  "routes".* FROM "routes" LIMIT $1 OFFSET $2  [["LIMIT", 11], ["OFFSET", 0]]

  def create
    @route = Route.new(route_params)
    respond_to do |format|
      if @route.save
---
INSERT INTO "routes" ("name_load", "date", "file", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name_load", "otro archivo de prueba"], ["date", "2018-12-06"], ["file", "datos_prueba.csv"], ["created_at", "2018-12-06 21:01:35.263261"], ["updated_at", "2018-12-06 21:01:35.263261"]]

  def destroy
    @route.destroy
---
DELETE FROM "routes" WHERE "routes"."id" = $1  [["id", 25]]