app/views/routes/show.html.erb

      <tbody>
        <% @route.stops.each do |stop| %>
---
SELECT "stops".* FROM "stops" WHERE "stops"."route_id" = $1  [["route_id", 35]]