app/models/route.rb

  def import
    file = self.file
    sheet = Roo::CSV.new(file.path)
    (2..sheet.last_row).each do |row|
      if sheet.cell(row-1,1) && sheet.cell(row-1,2) && sheet.cell(row-1,3) && sheet.cell(row-1,4) && sheet.cell(row-1,5)
        if row == 2
          if self.update(route: sheet.cell(row,1))
            stop = Stop.create(
              route: self,
              hour_arrival: sheet.cell(row,2),
              load: sheet.cell(row,3),
              latitude: sheet.cell(row,4),
              longitude: sheet.cell(row,5)
            )
          else
            self.destroy
          end
        elsif Route.find_by(route: sheet.cell(row,1)).present?
          route = Route.find_by(route: sheet.cell(row,1))
          stop = Stop.create(
            route: route,
            hour_arrival: sheet.cell(row,2),
            load: sheet.cell(row,3),
            latitude: sheet.cell(row,4),
            longitude: sheet.cell(row,5)
          )
        elsif sheet.cell(row,1).present?
---
INSERT INTO "routes" ("name_load", "route", "date", "callback", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name_load", "archivo de prueba"], ["route", 2], ["date", "2018-12-06"], ["callback", false], ["created_at", "2018-12-06 18:36:17.722628"], ["updated_at", "2018-12-06 18:36:17.722628"]]
INSERT INTO "stops" ("route_id", "hour_arrival", "load", "latitude", "longitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
DELETE FROM "routes" WHERE "routes"."id" = $1  [["id", 27]]
SELECT  1 AS one FROM "routes" WHERE "routes"."route" = $1 LIMIT $2  [["route", 1], ["LIMIT", 1]]
SELECT  "routes".* FROM "routes" WHERE "routes"."route" = $1 LIMIT $2  [["route", 1], ["LIMIT", 1]]
INSERT INTO "routes" ("name_load", "route", "date", "callback", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name_load", "otro archivo de prueba"], ["route", 1], ["date", "2018-12-06"], ["callback", false], ["created_at", "2018-12-06 18:30:40.838630"], ["updated_at", "2018-12-06 18:30:40.838630"]]
SELECT  1 AS one FROM "routes" WHERE "routes"."route" = $1 LIMIT $2  [["route", 2], ["LIMIT", 1]]

            date: date,
            callback: false
          )
          if new_route.save
            stop = Stop.create(
              route: new_route,
              hour_arrival: sheet.cell(row,2),
              load: sheet.cell(row,3),
              latitude: sheet.cell(row,4),
              longitude: sheet.cell(row,5)
            )
---
UPDATE "routes" SET "route" = $1, "updated_at" = $2 WHERE "routes"."id" = $3  [["route", 1], ["updated_at", "2018-12-06 20:09:31.134801"], ["id", 14]]
INSERT INTO "routes" ("name_load", "route", "date", "callback", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name_load", "archivo de prueba"], ["route", 2], ["date", "2018-12-06"], ["callback", false], ["created_at", "2018-12-06 21:16:09.666441"], ["updated_at", "2018-12-06 21:16:09.666441"]]
INSERT INTO "stops" ("route_id", "hour_arrival", "load", "latitude", "longitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"