app/models/stop.rb

class Stop < ApplicationRecord
  after_create :set_hour, if: Proc.new{|s| s.route.stops.count > 1}
---
SELECT COUNT(*) FROM "stops" WHERE "stops"."route_id" = $1  [["route_id", 4]]

  def set_hour
    hour_start = self.route.stops.collect(&:hour_arrival).min
    hour_end = self.route.stops.collect(&:hour_arrival).max
    self.route.update(hour_start: hour_start, hour_end: hour_end)
---
SELECT "stops".* FROM "stops" WHERE "stops"."route_id" = $1  [["route_id", 19]]
UPDATE "routes" SET "hour_start" = $1, "hour_end" = $2, "updated_at" = $3 WHERE "routes"."id" = $4  [["hour_start", "10:00"], ["hour_end", "10:00"], ["updated_at", "2018-12-06 20:22:26.946845"], ["id", 19]]